/* 算术运算符 */



/*------------------------常用的算术运算符-------------------------*/
/* +、-、*、/、% 整数除法会夹断结果中的小数部分*/
/* 下面举个经典的计算闰年的例子*/
int year = 800;
if ((year % 4) == 0 && year % 100 != 0) || year % 400 == 0)
{
	printf("%d is a leap year\n", year);
}
else
{
	printf("%d is not a leap year\n", year);
}

/* 取余运算符 % 不能应用于float 或者double类型*/
/* 在有负操作数的情况下，整数除法截取的方向以及取余运算的结果的符号取决于具体机器的实现，这和处理上溢和下溢的情况是一样的*/

/*-----------------------算术运算优先级----------------------------------*/

/* 
   算术运算符采用从左到右的结合规则
   () [] -> .                                  从左至右 
   ! ~ ++ -- + - * (type) sizeof               从右至左 
   * / %                                       从左至右 
   + -                                         从左至右 
   << >>                                       从左至右 
   < <= > >=                                   从左至右 
   == !=                                       从左至右
   &                                           从左至右
   ^                                           从左至右
   |                                           从左至右
   &&                                          从左至右
   ||                                          从左至右
   ? :                                         从左至右
   = += -= *= /= %= &= ^= |= <<= >>=           从右至左 
   ,                                           从右至左
*/